tap "cloudflare/cloudflare"
tap "dopplerhq/cli"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "steveyegge/beads"
tap "stripe/stripe-cli"
tap "symfony-cli/tap"

brew "bat"
brew "btop"
brew "cloudflared"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "go"
brew "jq"
brew "luarocks"
brew "mysql-client"
brew "mysql@8.4", restart_service: :changed
brew "ncdu"
brew "neovim"
brew "nnn"
brew "nvm"
brew "nx"
brew "parallel"
brew "php", restart_service: :changed
brew "pipx"
brew "python@3.13"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rust"
brew "tig"
brew "tmux"
brew "watch"
brew "wget"
brew "zoxide"
brew "zsh"

brew "hashicorp/tap/terraform"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "steveyegge/beads/bd"
brew "stripe/stripe-cli/stripe"
brew "symfony-cli/tap/symfony-cli"

cask "cityofzion-neon"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "raycast"
cask "rectangle"
